Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དགེ་སློང་དག་དེ་ལྟར་འདུན་པས་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་ཐོས་ནས། མིག་མཆི་མས་གང་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཇོ་ཇོ་ཁྱོད་ནི་དུས་མཁྱེན་པ། ཚོད་མཁྱེན་པ། རན་པ་མཁྱེན་པ་ལགས་ན།
en: Monks, when Chanda heard the Bodhisattva’s words, his eyes became filled with tears and he said, “Lord, you know the right time, the right moment, and the right occasion.

source: ད་ལྟར་ནི་བཞུད་པའི་དུས་དང་ཚོད་མ་ལགས་ན།
en: However, this is not the right time and not the occasion to leave.

source: ཅིའི་སླད་དུ་བཀའ་དེ་སྐད་སྩལ།
en: So why do you give me the order for leaving?”

source: བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། འདུན་པ་ད་ནི་དུས་ལ་བབ་པོ། །
en: The Bodhisattva replied, “Chanda, the time has come.”

source: སྨྲས་པ། ཇོ་ཇོ་གང་གི་དུས་ལ་བབ།
en: Then Chanda asked, “The time for what, my Lord?”

source: སེམས་ཅན་རྣམས་ཀྱི་དོན་ནི་ཚོལ་བ་ན།
en: “A long time ago, while seeking to benefit beings, I made the wish to liberate the world

source: །བྱང་ཆུབ་རྒ་ཤི་མེད་པའི་གནས་ཐོབ་ནས། །འགྲོ་བ་དགྲོལ་ཞེས་ང་ཡིས་ཡུན་རིང་ནས། །སྨོན་ལམ་བཏབ་པ་དེ་ཡི་དུས་ལ་བབ། །འདི་ལ་འདི་ནི་ཆོས་ཉིད་དེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ།
en: Once I attained the state of awakening beyond old age or death. Now that time has come.” On this topic, it is said: At the time when the Supreme Being departed, All the gods were eager to present offerings.

source: །ས་བླ་བ་དང་བར་སྣང་དེ་བཞིན་སྐྱོང་།
en: All protector gods of heaven and earth came,

source: །ལྷ་དབང་བརྒྱ་བྱིན་རང་གི་ཕྱོགས་དང་བཅས།
en: As did Śakra, lord of the gods, along with his following.

source: །འཐབ་བྲལ་ལྷ་དང་དགའ་ལྡན་འཕྲུལ་དགའ་དང་། །གཞན་འཕྲུལ་དབང་བྱེད་ལྷ་རྣམས་བརྩོན་པར་གྱུར། །ཀླུ་རྒྱལ་ཆུ་ལྷ་དང་ནི་གཟི་ཅན་དང་། །མ་དྲོས་པ་དང་དེ་བཞིན་རྒྱ་མཚོ་ཡང་། །མི་མཆོག་མངོན་པར་བྱུང་བའི་དུས་བབ་པས། །དེ་དག་རྣམས་ཀྱང་མཆོད་ཕྱིར་བརྩོན་པར་གྱུར།
en: The gods of the Heaven Free from Strife, the Heaven of Joy, and the Heaven of Delighting in Emanations, And the gods of the Heaven of Making Use of Others’ Emanations all came. So did the nāga kings Varuṇa, Manasvin, Anavapta, as well as Sāgara.

source: །གང་དག་གཟུགས་ན་སྤྱོད་པའི་ལྷ་རྣམས་དང་། །རྟག་ཏུ་བསམ་གཏན་སྤྱོད་ཡུལ་རབ་ཞི་སྤྱད།
en: The gods in the form realm also came, Those who always experience the peace of concentration.

source: །དེ་དག་རྣམས་ཀྱང་འཇིག་རྟེན་གསུམ་མཆོད་པ། །མི་མཆོག་དེ་ལ་མཆོད་ཕྱིར་མངོན་པར་བརྩོན།
en: They were in a hurry to make offerings to the Supreme Being, Who is worthy of honor in all the three realms.

source: །སྔོན་སྤྱད་སྤྱོད་ཚེ་གྲོགས་པོར་གྱུར་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་བཅུར་ལྷགས་པ་ཡང་།
en: Also the bodhisattvas, who were his companions in past actions, Gathered there from all ten directions, saying,

source: །རྒྱལ་བ་མངོན་པར་འབྱུང་བ་ལྟ་བྱེད་ཅིང་།
en: “Let us see the departure of the Victorious One,

source: །རྗེས་སུ་འཐུན་པས་མཆོད་པ་བྱ་སྙམ་བྱེད།
en: And make offerings to him in an appropriate manner.”

source: །གསང་བའི་བདག་པོ་བདག་ཉིད་ཆེན་པོ་དེ།
en: The great being who is lord of the guhyakas,

source: །རྡོ་རྗེ་འབར་ཐོགས་ནམ་མཁའི་དཀྱིལ་ན་གནས།
en: Pradīptavm≥ajra, positioned himself in the sky above.

source: །ལུས་ལ་གོ་བགོས་སྟོབས་བརྩོན་རྩལ་དང་ལྡན།
en: Wearing armor, strong, brave, and energetic,

source: །གསང་བ་ལག་ན་རྡོ་རྗེ་འབར་བ་ཐོགས།
en: He held a blazing vajra in his hand. Sūrya

source: །ལྷའི་བུ་ཉི་མ་ཟླ་བ་དེ་གཉིས་ཀྱང་།
en: Moon and Candra, these two gods,

source: །གཡས་དང་གཡོན་ན་རབ་ཏུ་གནས་པར་གྱུར།
en: Came to stand to his right and left.

source: །སོར་མོ་བཅུ་ཡི་ཐལ་མོ་སྦྱར་བྱས་ཏེ།
en: They joined their palms together

source: །མངོན་པར་འབྱུང་ལ་རྗེས་སུ་རྟོག་པར་བྱེད།
en: And reflected on the Bodhisattva’s departure.

source: །སྐར་མ་རྒྱལ་དེ་འཁོར་དང་བཅས་པ་ཡང་།
en: The constellation Puṣya as well, with his retinue,

source: །རང་གི་ལུས་ནི་རྒྱ་ཆེན་སྤྲུལ་བྱས་ཏེ།
en: Transformed his body in a majestic way,

source: །མི་ཡི་དམ་པ་དེ་ཡི་མདུན་འདུག་ནས།
en: And stood before the noblest of men.

source: །ཡིད་དུ་འོང་བའི་སྒྲ་ནི་རབ་འབྱིན་ཏེ།
en: With a delightful voice he spoke:

source: །སྐར་མ་རྒྱལ་ལྡན་བཞུད་པའི་དུས་ལ་བབ།
en: “Now that Puṣya is present, this is the perfect time to leave.

source: །དོ་མོད་ཁྱོད་དགེ་བཀྲ་ཤིས་ཐམས་ཅད་གྲུབ།
en: Tonight all your virtuous and auspicious prayers will be fulfilled;

source: །བདག་ཀྱང་ཁྱོད་དང་ཐབས་ཅིག་མཆི་བར་བགྱི།
en: I will accompany you.

source: །འདོད་ཆགས་སེལ་བ་བར་ཆད་འབྱུང་མི་འགྱུར།
en: As you make an end to desire, may you encounter no obstacles!

source: །ལྷའི་བུ་ཡང་དག་བསྐུལ་པོས་བསྐུལ་བྱས་པ།
en: “You have been encouraged by the god Sañcodaka.

source: །སྟོབས་དང་བརྩོན་འགྲུས་འཕགས་པ་མྱུར་དུ་བཞེངས།
en: Now swiftly manifest your strength and courage,

source: །སྡུག་བསྔལ་ཉེན་པའི་སེམས་ཅན་ཐམས་ཅད་སྒྲོལ།
en: And liberate all beings who are oppressed by misery!

source: །ད་ནི་མངོན་པར་འབྱུང་བའི་དུས་ལ་བབ།
en: Now is the right time for you to leave!”

source: །ལྷ་རྣམས་བྱེ་བ་སྟོང་ཕྲག་མང་པོ་ཡང་།
en: Billions of gods had gathered

source: །ཡིད་འོང་མེ་ཏོག་ཆར་པ་འབེབས་ཤིང་ལྷགས།
en: And let a rain of ravishing flowers fall down.

source: །དེ་ནི་སྐྱིལ་མོ་ཀྲུང་བཅས་མཆོག་ལ་འདུག །ལྷ་ཡིས་བསྐོར་ཅིང་མཛེས་ལ་གཟི་བརྗིད་འབར།
en: The Bodhisattva, for his part, sat there in the perfect cross-legged posture; Surrounded by gods, he was so beautiful, blazing with splendor.

source: །གྲོང་ཁྱེར་ན་ནི་སྐྱེས་པ་བུད་མེད་ཁྱེའུ་དང་བུ་མོ་གང་ཡོད་པ།
en: In the city, all men, women, and children

source: །དེ་དག་ཐམས་ཅད་ཡིད་དལ་གྱུར་ནས་ཉལ་ཏེ་སྤྱོད་ལམ་རྣམས་ལས་ཉམས།
en: Became tired and fell asleep, abandoning their chores.

source: །རྟ་དང་གླང་པོ་བ་ལང་ནེ་ཚོ་ཁྲུང་ཁྲུང་རྨ་བྱ་རི་སྐེགས་རྣམས།
en: The horses, elephants, oxen, parrots, cranes, peacocks, and mynas

source: །དེ་དག་རྣམས་ཀྱང་ཡིད་དལ་མྱུར་དུ་ཉལ་ཏེ་དེ་དག་གཟུགས་མི་མཐོང་།
en: Became tired and quickly slept, not noticing anything.

source: །ཤཱཀྱའི་བུ་གང་རྡོ་རྗེ་སྲ་བ་མཚོན་ཆ་རྩེ་གཉིས་ཐོགས་བཀོད་དང་། །གླང་ཆེན་རྟ་དང་ཤིང་རྟ་རྟ་བབས་མཆོག་དྲུང་བཀོད་པ་དེ་དག་ཉལ།
en: Armed with lances hard as vajra, and mounted on elephants, horses, and chariots, The Śākya youths who kept guard also fell asleep,

source: །རྒྱལ་པོ་རྒྱལ་བུ་རྒྱལ་པོའི་སྐྱེ་བོ་ཀུན་ཀྱང་གཉིད་ཀྱིས་ལོག་པར་གྱུར།
en: As did the king, the princes, and the royal pages.

source: །བུད་མེད་ཚོགས་རྣམས་གཉིད་ལོག་གོས་བྲལ་གཅེར་བུར་གྱུར་ཀྱང་ཡང་མ་ཚོར།
en: The retinue of consorts, completely naked, were asleep and oblivious.

source: །དེ་ནི་ཚངས་དབྱངས་ཡིད་དུ་འོང་ཚིག་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་ཀྱིས། །ནམ་ཕྱེད་འདས་ཏེ་ནམ་གྱི་གུང་ལ་བབ་ནས་འདུན་པ་དེ་ལ་སྨྲས།
en: As midnight arrived, the Bodhisattva spoke to Chanda In a voice captivating like Brahmā’s and sweet as a nightingale:

source: །འདུན་པ་རྟ་ཕོ་བསྔགས་ལྡན་བཟང་པོ་ལེགས་བརྒྱན་ལེགས་པར་ང་ལ་བྱིན།
en: “Chanda, bring Kaṇṭhaka, well adorned and well groomed.

source: །གལ་ཏེ་ང་ལ་བྱམས་པར་སེམས་ན་བགེགས་མ་བྱེད་པར་མྱུར་དུ་བྱིན།
en: Do not create obstacles and do not hesitate, if you have any affection for me.”

source: །འདུན་པས་ཚིག་ཐོས་མཆི་མས་མིག་གང་རང་གི་ཇོ་བོ་དེ་ལ་སྨྲས།
en: Chanda’s eyes filled with tears as he spoke to his master‌:

source: །སེམས་ཅན་ཁ་ལོ་སྒྱུར་མཆོག་གར་བཞུད་བཅིབས་པས་ཅི་ཞིག་བགྱི།
en: “Great Charioteer, where will you go? What do you need the horse for?

source: །དུས་མཁྱེན་ཅིང་ནི་ཚོད་མཁྱེན་ཆོས་སྤྱོད་གང་དུའང་གཤེགས་པའི་དུས་མ་ལགས།
en: You know the right time and moment, and this is not the time to practice the Dharma.

source: །ཁྱོད་ཀྱི་སྒོ་བཀུམ་གཏན་པ་དམ་སྩལ་སུ་ཡང་ཆབ་སྒོ་འབྱེད་མི་འགྱུར།
en: The gates are shut and firmly bolted, so who will open them for you?”

source: །བརྒྱ་བྱིན་གྱི་ནི་ཡིད་ཀྱི་སེམས་པའི་དབང་གིས་སྒོ་ཡང་བྱེ་བར་གྱུར།
en: Right then Śakra opened the gate merely by the power of his mind;

source: །འདུན་པས་དེ་འདྲ་མཐོང་ནས་དགའ་ཞིང་སྡུག་བསྔལ་དེ་ནི་མཆི་མ་འཁོར།
en: Chanda was thrilled at the sight, yet also sad and on the verge of tears.

source: །ཀྱི་ཧུད་བདག་གྲོགས་སུ་ཡོད་ཇི་ལྟར་བྱ་ཞིང་ཕྱོགས་ནི་གར་བརྒྱུག་སྙམ།
en: “Oh no, what shall I do now? Who can help? To whom should I turn?

source: །གཟི་བརྗིད་ལྡན་པས་དྲག་ཤུལ་ཅན་གྱི་ཚིག་སྨྲས་བརྒྱ་བྱིན་འབའ་ཞིག་ཐོས།
en: Śakra will only listen to the one with such invincible power.

source: །ཡན་ལག་བཞི་ལྡན་དཔུང་དང་བཅས་པ་འདི་ཡང་འདི་ན་ཅི་ཞིག་བྱེད།
en: “What use is this powerful army with its four divisions?

source: །རྒྱལ་པོ་རྒྱལ་བུ་རྒྱལ་པོའི་སྐྱེ་བོ་དེ་དག་རྣམས་ཀྱིས་འདི་མ་ཚོར།
en: The king, the princes, and the royal pages—none of them know what the Bodhisattva is doing.

source: །བུད་མེད་ཚོགས་ཀྱང་གཉིད་ལོག་ལྷ་རྣམས་ཀྱིས་ནི་གྲགས་ལྡན་གཉིད་ལོག་བྱས།
en: Yaśovatī and the retinue of consorts are in their beds, lulled to sleep by the gods.

source: །ཀྱི་ཧུད་འདི་ཡིས་སྔོན་ཆད་བསམས་པའི་སྨོན་ལམ་ཐམས་ཅད་གྲུབ་གྱུར་ཅིག །ལྷ་སྟོང་བྱེ་བ་དེ་དག་དགའ་བའི་ཡིད་ཀྱིས་འདུན་པ་དེ་ལ་སྨྲས།
en: Alas! He is leaving. The vow he made in the past is now being fulfilled!” Right then, billions of overjoyed gods spoke to Chanda:

source: །འདུན་པ་རྟ་མཆོག་བསྔགས་ལྡན་ལེགས་པར་ཕུལ་ཅིག་འདྲེན་པ་སྐྱོ་མི་བྱ།
en: “Chanda, bring him the excellent horse Kaṇṭhaka. Do not disappoint our guide.

source: །ལྷ་དང་ལྷ་མིན་དག་གིས་རྔ་དུང་རྫ་རྔ་རོལ་མོ་ཁྲག་ཁྲིག་བྱས།
en: The gods and demigods play their millions of drums and instruments,

source: །འོན་ཀྱང་ལྷས་བསྙལ་བ་ཡི་གྲོང་ཁྱེར་མཆོག་འདི་སད་པར་ཡོང་མ་གྱུར།
en: And still this supreme city that the gods have put to sleep does not awake!

source: །འདུན་པ་བར་སྣང་དྲི་མ་མེད་ལ་ལྷ་ཡི་འོད་རབ་མཛེས་ལ་ལྟོས།
en: “Chanda, look to the pure sky where a divine light shines so beautifully!

source: །ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་མང་པོ་མཆོད་ཕྱིར་གང་ལྷགས་ལྟོས།
en: Look at the millions of assembled bodhisattvas making offerings.

source: །བདེ་སོགས་ཁྱིམ་ཐབ་བརྒྱ་བྱིན་དཔུང་བསྐོར་སྒོ་ན་མཛེས་པར་འདུག་པ་དང་། །ལྷ་དང་ལྷ་མིན་མི་འམ་ཅི་ཚོགས་གང་དག་མཆོད་ཕྱིར་ལྷགས་ལ་ལྟོས།
en: Look at glorious Śakra, Śacī’s husband, who is at the gates with his army. Look at the gods, demigods, and kinnaras who are here making offerings!”

source: །འདུན་པ་དེས་ཀྱང་ལྷ་ཚིག་དེ་ཐོས་བསྔགས་ལྡན་རྟ་ཕོ་དེ་ལ་སྨྲས།
en: Chanda heard the gods and told the horse Kaṇṭhaka,

source: །སེམས་ཅན་ཁ་ལོ་སྒྱུར་མཆོག་འདི་བཞུད་ཁྱོད་ནི་རྟ་སྐད་སྒྲོགས་ཤིང་ཤོག །དེ་ཡིས་དབྱར་གྱི་ཁ་དོག་ཅན་དེ་རྨིག་པ་གསེར་གྱིས་བརྒྱན་བྱས་ནས།
en: “You must neigh now, because here comes the supreme charioteer of beings!” Then he adorned the horse’s jasmine-colored hoofs with gold.

source: །ཡིད་མི་དགའ་བཞིན་ཡོན་ཏན་རྒྱ་མཚོ་མངའ་བའི་བཅིབས་པར་དབུལ་བ་བྱས།
en: Distressed and weeping, he gave the horse to He Who Is an Ocean of Qualities, saying:

source: །མཚན་མཆོག་མངའ་ཞིང་ཕན་མཛད་ཁྱོད་ཀྱི་ཆིབས་འདི་རིགས་བཟང་དགེ་བ་ལགས།
en: “You with noble marks who benefits others, here is your horse of virtuous pedigree.

source: །ཁྱོད་ཀྱིས་སྔོན་ཆད་གང་བགོས་སྨོན་ལམ་དེ་གྲུབ་གྱུར་ཅིག་གཤེགས་སུ་གསོལ།
en: May all your past aspirations become fulfilled! Please proceed!

source: །གང་དག་བགེགས་བགྱིད་ཞི་བར་གྱུར་ཅིག་དགོངས་པའི་བརྟུལ་ཞུགས་གྲུབ་གྱུར་ཅིག །འགྲོ་བ་ཀུན་ལ་བདེ་དང་མཐོ་རིས་པ་དང་ཞི་བ་སྦྱིན་གྱུར་ཅིག །དེ་ནི་གང་ཚེ་མལ་ནས་ལངས་ཚེ་ས་འདི་ཐམས་ཅད་རྣམ་དྲུག་གཡོས།
en: May all obstacles be pacified and your desired disciplined conduct be accomplished! May you grant all beings happiness, rebirth in the higher realms, and peace!” When the Bodhisattva rose from his seat, the earth shook in six ways;

source: །རྟ་རྒྱལ་དམ་པ་ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་འདྲ་བ་དེ་ལ་ཞོན།
en: He mounted the supreme king of horses that resembled the full moon.

source: །སྐྱོང་བའི་ལག་པ་རྣམ་དག་པད་མ་དྲི་མེད་འདྲ་བས་རྟ་མཆོག་བཏེག །བརྒྱ་བྱིན་ཚངས་པ་དེ་གཉིས་དེ་ཡི་མདུན་ན་ལམ་ནི་འདི་ཞེས་སྟོན།
en: The guardians, with their pure lotus-like hands, then lifted up the supreme horse; Śakra and Brahmā went in the front, showing the way.

source: །དེ་ཡིས་གསལ་བ་དྲི་མ་མེད་པའི་འོད་བཏང་ས་རྣམས་སྣང་བས་གསལ།
en: The pure and bright light sent forth by the Bodhisattva illumined the earth;

source: །དེ་ཚེ་ངན་སོང་ཀུན་ཞི་སེམས་ཅན་བདེ་ལྡན་ཉོན་མོངས་གནོད་པ་མེད།
en: The lower realms were pacified, and all beings were happy and free from afflictions.

source: །མེ་ཏོག་ཆར་བབ་སིལ་སྙན་བྱེ་བ་སྒྲ་བྱུང་ལྷ་དང་ལྷ་མིན་བསྟོད།
en: A rain of flowers fell, millions of instruments sounded, and gods and demigods rejoiced;

source: །ཐམས་ཅད་དགའ་དང་ལྡན་ནས་གྲོང་ཁྱེར་མཆོག་ལ་བསྐོར་བ་བྱས་ཏེ་དོང་།
en: All of them circumambulated the city and departed filled with delight.

source: །སྐྱེས་བུ་ཆེན་པོ་སོང་བས་གྲོང་ཁྱེར་དམ་པའི་ལྷ་ཡང་ཡིད་ནི་དམན་པར་གྱུར་ནས་འོངས།
en: Since the Great Being was leaving, the deity of the best of cities came, feeling depressed.

source: །མདུན་དུ་འདུག་ནས་སྙིང་རྗེར་ངུ་བའི་ཡིད་ལྡན་དེ་ཡིས་པད་མ་འདྲ་བའི་བཞིན་ལ་སྨྲས།
en: Appearing before the Bodhisattva, the deity spoke to his lotus face, feeling miserable and dejected:

source: །ཁྱོད་བྲལ་སྒྲེན་མོར་མི་མཛེས་ས་འདི་གྲོང་ཁྱེར་ཐམས་ཅད་མུན་པས་ཀུན་ཏུ་དཀྲུགས་པར་གྱུར།
en: “If you leave, the city will become disturbed and steeped in darkness.

source: །དོ་མོད་ཁྱོད་ཀྱིས་ཁབ་འདི་སྤངས་ན་བདག་ལ་དགའ་བདེ་བགྱིད་པ་འདི་ན་འགའ་མ་མཆིས།
en: If tonight you abandon your palace, there will be no joy and no happiness for me.

source: །སླན་ཆད་བྱ་ཚོགས་རྣམས་ཀྱིས་སྒྲ་དག་དང་། །གྲགས་པ་མཐའ་ཡས་ཁྱོད་ནི་སད་བགྱིད་པའི། །བཙུན་མོའི་འཁོར་གྱི་གླིང་བུ་སྙན་པ་དང་། །བཀྲ་ཤིས་སྒྲ་དང་གླུ་སྒྲ་ཐོས་མི་འགྱུར།
en: “No longer will I hear the singing of the birds, Or the sweet sound of the flute in the female quarters, Or the sound of songs with propitious lyrics, Which you, One of Infinite Fame, used to hear on waking up.

source: །ཉོན་མོངས་བཅོམ་པ་ཁྱོད་ནི་གཤེགས་གྱུར་ན། །གདུགས་མཚན་ཁྱོད་ལ་མཆོད་པ་བགྱིད་པ་ཡི། །ལྷ་དང་གྲུབ་ཚོགས་སླན་ཆད་མཐོང་མི་འགྱུར། །ལྷ་ཡི་དྲི་ཡང་སླན་ཆད་སྣོམ་མི་འགྱུར། །ཕྲེང་བ་བཏགས་ནས་ཞག་ལོན་གྱུར་པ་ལྟར།
en: “No longer will I behold the assembly of divine siddhas Who make offerings to you day and night, Nor will I be able to smell any longer the divine scents, If you, who conquers emotions, abandons this palace tonight.

source: །ཁྱོད་ཀྱིས་དོ་མོད་ཕོ་བྲང་དེ་བཞིན་སྤངས། །ཁྱོད་བཞུད་སླན་ཆད་གཟི་བརྗིད་དཔལ་མ་མཆིས། །
en: “This palace, if abandoned by you, Will be like a withered and used garland; It will seem like an empty stage.

source: གར་ལ་ལྟ་བ་བཞིན་དུ་བདག་ལ་གདའ།
en: When you are gone, all magnificence and splendor will disappear.

source: །གྲོང་ཁྱེར་ཀུན་གྱི་བྱིན་དང་སྟོབས་ཕྲོགས་ཏེ། །འདི་ནི་དགོན་པ་འདྲ་ཞིང་མཛེས་མ་ལགས། །གང་གིས་ས་འདིར་འཁོར་ལོ་སྟོབས་ཅན་དུ།
en: “You will take away the vitality and power from this entire city; Like a wasteland, it will shine with beauty no more.

source: །ལུང་བསྟན་དྲང་སྲོང་ཚིག་ནི་དེང་བརྫུན་གྱུར།
en: Today, disproved are the sages’ prophecies

source: །བསོད་ནམས་སྡོང་པོ་ཆེན་པོ་ཁྱོད་བྱུང་ན།
en: That you will be a universal monarch on earth.

source: །ས་འདིར་ཤཱཀྱའི་སྟོབས་ནི་སྟོབས་མ་མཆིས།
en: “The might of the Śākyas on this earth will come to nothing,

source: །རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་འདིར་གདུང་ཡང་འཆད།
en: And the royal family line will be interrupted.

source: །ཤཱཀྱའི་ཚོགས་འདི་བསམ་པ་རབ་ཏུ་ཉམས།
en: The hopes of the assembly of Śākyas will be dashed entirely If you, the great tree of merit, depart.

source: །དྲི་མེད་དྲི་བྲལ་ཁྱོད་ནི་གར་བཞུད་པར།
en: “Immaculate One, Faultless One, let me go with you,

source: །བདག་ཀྱང་ཁྱོད་དང་ལྷན་ཅིག་མཆི་བར་བགྱི།
en: Wherever you wish to depart for.

source: །འོན་ཀྱང་ཐུགས་བརྩེ་ཐུགས་རྗེ་བསྐྱེད་ནས་ནི།
en: Yet please engender love and compassion,

source: །ཁྱོད་ཀྱིས་ཕོ་བྲང་འདི་ལ་གཟིགས་སུ་གསོལ།
en: And take one more look at this palace!”

source: །བློ་གྲོས་ལྡན་པ་ཁྱིམ་ལ་བལྟས་ནས་ནི།
en: The Intelligent One looked at the palace

source: །སྙན་པའི་ང་རོས་འདི་སྐད་ཚིག་སྨྲས་ཏེ།
en: And spoke in the sweetest voice:

source: །སྐྱེ་འཆི་མཐར་འབྱིན་མ་ཐོབ་བར་དུ་ནི།
en: “Until I have made an end to birth and death,

source: །ང་ཡིས་སེར་སྐྱའི་གྲོང་ཁྱེར་འཇུག་མི་བྱ།
en: I will not return to the city of Kapilavastu.

source: །རྒ་ཤི་མེད་པའི་གནས་མཆོག་འཆི་མེད་པ། །བྱང་ཆུབ་དམ་པ་ང་ཡིས་མ་ཐོབ་པར།
en: “Until I have attained precious awakening, The supreme level of immortality beyond old age and dying,

source: །ང་ནི་སེར་སྐྱའི་གནས་སུ་མངོན་ཕྱོགས་ཏེ།
en: I will not turn my face toward Kapilavastu,

source: །འགྲེང་འདུག་ཉལ་དང་འཆག་པར་མི་བྱའོ།
en: Whether I am standing, sitting, lying down, or walking.”

source: །གང་ཚེ་འགྲོ་བའི་གཙོ་བོ་པ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་བྱུང་ཞིང་། །དེ་ནི་མཁའ་ལས་འགྲོ་བའི་ཚེ། །ལྷ་ཡི་བུ་མོ་རྣམས་ཀྱིས་བསྟོད།
en: When the Bodhisattva, the Lord of Beings, departed, The celestial maidens traveling through the sky began to sing his praise:

source: །འདི་ནི་སྦྱིན་པའི་གནས་ཆེན་ཡིན། །འདི་ནི་བསོད་ནམས་ཞིང་ཆེན་ཡིན།
en: “He is the marvelous object of offering and a great field of merit,

source: །འདི་ནི་བསོད་ནམས་འདོད་པའི་ཞིང་། །འཆི་མེད་འབྲས་བུ་སྦྱིན་མཛད་པ།
en: The field for those wishing for merit, and the giver of the fruit of immortality.

source: །སེམས་ཅན་རྣམས་ལ་ཐུགས་རྗེ་བས། །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ།
en: “Out of compassion for sentient beings, he has throughout ten million eons

source: །སྦྱིན་དང་དུལ་དང་སྡོམ་པ་ཡིས། །འདིས་ནི་བྱང་ཆུབ་ཡང་དག་བསྒྲུབས།
en: Trained in generosity, self-control, and restraint, and thus attained awakening.

source: །འདི་ཡི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག །བརྟུལ་ཞུགས་བཟང་ཞིང་སྤྱོད་མ་ཉམས། །འདོད་པ་དག་དང་ལོངས་སྤྱོད་རྣམས། །དོན་དུ་མི་གཉེར་ཚུལ་ཁྲིམས་སྲུང་།
en: His discipline is pure, his conduct excellent, and his practice undiminished; He did not pursue pleasures and enjoyments, but observed discipline.

source: །སེམས་ཅན་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར། །འདི་ནི་རྟག་ཏུ་བཟོད་པ་གསུང་།
en: “He always spoke patiently to protect others;

source: །ཡན་ལག་ཉིང་ལག་གཅད་གྱུར་ཀྱང་། །ཁྲོ་བ་མི་མངའ་སྡང་མི་མངའ། །
en: Even when his limbs were cut off, he was never angry or hostile.

source: འདི་ནི་རྟག་ཏུ་བརྩོན་འགྲུས་ལྡན། །བསྐལ་པ་བྱེ་བར་སྐྱོ་མི་མངའ། །
en: Constantly diligent for millions of eons, he never felt disheartened;

source: འདི་ཡིས་བྱང་ཆུབ་ཡང་དག་བསྒྲུབས། །མཆོད་སྦྱིན་དག་ནི་བྱེ་བ་མཛད།
en: Thus he has awakened and performed millions of sacrifices.

source: །འདི་རྟག་བསམ་གཏན་བསམ་གཏན་པ། །ཐུགས་ནི་ཞི་ཞིང་རབ་ཏུ་ཞི།
en: “Always in meditative concentration, his mind has become calm and tranquil;

source: །ཉོན་མོངས་ཐམས་ཅད་བསྲེགས་ནས་ནི། །སེམས་ཅན་བྱེ་བ་འགྲོལ་བར་འགྱུར།
en: Since he has burned away all emotions, he will liberate millions of beings.

source: །འདི་ནི་ཤེས་རབ་ཆགས་མི་མངའ། །རྟོག་དང་རྣམ་པར་རྟོག་ལྡན་ལས། །གྲོལ་ཞིང་ཐུགས་ནི་རྣམ་གྲོལ་ཏེ། །རང་བྱུང་བ་ཡི་རྒྱལ་བར་འགྱུར།
en: He possesses unobstructed knowledge and is free from conceptual thinking; With a mind free from conceptuality, he will become a self-arising victor.

source: །འདི་ནི་རྟག་ཏུ་བྱམས་ཐུགས་ལྡན། །ཐུགས་རྗེ་ཡི་ནི་ཕ་རོལ་བྱོན།
en: “His mind is always suffused with love, and his compassion is complete;

source: །དགའ་དང་བཏང་སྙོམས་བསམ་གཏན་པ། །ཚངས་པའི་ལམ་གྱི་ཆོ་ག་མཁྱེན།
en: He possesses joy, equanimity, concentration, and knows the four immeasurables.

source: །འདི་ནི་ཤིན་ཏུ་ལྷ་ཡི་ལྷ། །ལྷ་རྣམས་ཀྱིས་ནི་མཆོད་པའི་འོས།
en: He is the supreme god of gods, worthy of all gods’ worship;

source: །ཐུགས་དགེ་དག་ཅིང་དྲི་མ་བྲལ། །ཡོན་ཏན་ཁྲག་ཁྲིག་ཕ་རོལ་བྱོན།
en: With his pure, stainless, and sublime mind, he perfected millions of qualities.

source: །འཇིགས་པས་ཉེན་པ་རྣམས་ཀྱི་སྐྱབས། །མིག་མེད་རྣམས་ཀྱི་སྒྲོན་མ་སྟེ། །གནོད་པ་རྣམས་ཀྱི་སྐྱབས་ཀྱང་ལགས། །རིང་ནས་ན་བའི་སྨན་པ་ལགས།
en: “He is a refuge for the frightened, and a lamp for the blind; He is a place of rest for the persecuted, and a physician for those long sick.

source: །རྒྱལ་པོ་དམ་པ་ཆོས་ཀྱི་རྒྱལ། །དབང་པོ་ལྟ་བུར་སྤྱན་སྟོང་མངའ།
en: He is like a king, a righteous king, like Śakra with a thousand eyes,

source: །ཚངས་པ་ལྟ་བུར་རང་བྱུང་གྱུར། །ལུས་དང་སེམས་ནི་རབ་སྦྱངས་པ།
en: Like the self-arisen Brahmā, pure in body and mind.

source: །བརྟན་ཞིང་ཤེས་རབ་རབ་ཏུ་མང་། །དཔའ་ཞིང་ཐུགས་ནི་འདོད་ཆགས་བྲལ།
en: “He is firm with abundant knowledge, diligent and detached;

source: །ཉོན་མོངས་འཇོམས་པས་དཔའ་བོ་སྟེ།
en: He is a hero because he destroyed the afflictions;

source: །མ་རྒྱལ་དགྲ་ལས་རྒྱལ་བ་ལགས།
en: undefeated, he conquers all enemies.

source: །སེང་གེ་ལྟ་བུར་བསྙེངས་པ་སྤངས། །གླང་པོ་ལྟ་བུར་རབ་དུལ་ཐུགས།
en: He is fearless like a lion and gentle like an elephant;

source: །ཁྱུ་མཆོག་ལྟ་བུར་ཚོགས་ཀྱི་གཙོ། །བཟོད་དེ་འཁྲུག་པ་རབ་ཏུ་སྤངས།
en: He is the leader of the herd like a perfect bull, always patient and without anger.

source: །ཟླ་བ་ལྟ་བུར་རབ་ཏུ་གསལ། །ཉི་མ་ལྟ་བུར་སྣང་བ་མཛད། །
en: “He is bright like the moon and illuminating like the sun;

source: སྒྲོན་མ་ལྟ་བུར་གསལ་མཛད་པ། །སྐར་མ་ལྟ་བུར་མུན་པ་བྲལ།
en: He shines like a torch and glows like a star.

source: །པད་མ་ལྟ་བུར་ཆགས་མི་མངའ། །མེ་ཏོག་ལྟ་བུར་ཁྲིམས་དྲི་གདའ།
en: He is unstained like a lotus, and his discipline smells sweet like a flower;

source: །སྟོན་པ་ལྷུན་པོ་ལྟར་མི་གཡོ། །དོག་ས་ལྟ་བུར་གསོས་སུ་གྱུར།
en: This teacher is immovable like Mount Meru and provides sustenance like the earth;

source: །རིན་ཆེན་འབྱུང་གནས་ལྟར་མི་འཁྲུགས།
en: He is unshakable like an ocean.

source: །འདི་ནི་ཕུང་པོའི་བདུད་ལས་རྒྱལ།
en: “He has defeated the demon of the afflictions and the demon of the aggregates;

source: །འདི་ནི་འཆི་བདག་བདུད་ལས་རྒྱལ། །འདི་ནི་ལྷ་ཡི་བདུད་ཀྱང་བཅོམ།
en: He has defeated the demon of death and the demon of the god.

source: །འདི་ནི་དེད་དཔོན་ཆེན་པོ་སྟེ། །ལམ་ངན་དག་ན་གནས་རྣམས་ལ། །ཡན་ལག་བརྒྱད་པ་ལམ་གྱི་མཆོག །རིང་པོར་མི་ཐོགས་སྟོན་པར་འགྱུར།
en: He is the great leader who soon will teach the supreme, eightfold path of the noble ones To those who are established in wrong paths.

source: །རྒ་ཤི་ཉོན་མོངས་འཇོམས་པ་པོ། །མུན་པ་རབ་རིབ་རྣམ་པར་གྲོལ།
en: “Free from the darkness of ignorance, he destroys old age, death, and the afflictions;

source: །ས་དང་ལྷ་ཡུལ་གྲགས་པ་ཡི། །རང་བྱུང་རྒྱལ་བར་བྱོན་པ་ལགས།
en: He will become the self-arisen victor, famous on earth and in heaven.

source: །སྐྱེས་བུ་མཆོག་གི་གཟུགས་མངའ་བ། །དཔག་ཏུ་མེད་ལ་བསྟོད་པས་བསྟོད།
en: In the form of a supreme being, he is praised in infinite ways;

source: །ཁྱོད་ལ་བསྟོད་པའི་བསོད་ནམས་དེས། །སྨྲ་བའི་སེང་གེ་འདྲ་བར་ཤོག །
en: Through the merit of praising you, may we become like you, the lion of speech.”

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་བྱུང་ནས་ཤཱཀྱའི་ཡུལ་དང་། ཀཽ་ཏའི་ཡུལ་དང་། གྱད་ཡུལ་ལས་འདས་ཏེ་མེ་ནེ་ཡའི་ཡུལ་གྱི་གྲོང་རྡལ་རྗེས་སུ་དཔག་པ་ཞེས་བྱ་བ་ནས་དཔག་ཚད་དྲུག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིན་པ་དང་ནམ་ནངས་པར་གྱུར་ཏོ།
en: Monks, once the Bodhisattva had left his home, he crossed over the lands of the Śākyas, the Kroḍyas, and the Mallas. When day broke, he had arrived six leagues away from the town of Anumaineya in the country of Maineya.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྟ་བསྔགས་ལྡན་ལས་བབས་ཏེ་ས་ལ་འདུག་ནས། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་ཆེན་པོ་སླར་བཀྱེའོ།
en: There he dismounted from his horse Kaṇṭhaka and, once he was on the ground, he dismissed the great assembly of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas.

source: །སླར་བཀྱེ་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། རྒྱན་འདི་དག་དང་རྟ་བསྔགས་ལྡན་ཡང་འདུན་པའི་ལག་ཏུ་གཏད་དེ་སླར་གཏང་ངོ་སྙམ་མོ།
en: Then he thought to himself, “I should entrust these ornaments and the horse Kaṇṭhaka to Chanda, and then send him back.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་འདུན་པ་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: So he summoned Chanda and told him,

source: །འདུན་པ་ཁྱོད་སོང་ལ་རྒྱན་འདི་དག་དང་རྟ་བསྔགས་ལྡན་ཁྱེར་ཏེ་སླར་ལོག་ཤིག །ས་ཕྱོགས་གང་ནས་འདུན་པ་སླར་ལོག་པ་དེར་མཆོད་རྟེན་བརྩིགས་ཏེ།
en: “Chanda, you should go back now. Take these ornaments and my horse Kaṇṭhaka and return to the palace.”

source: དེང་སང་དུ་ཡང་མཆོད་རྟེན་དེ་ལ་འདུན་པ་སླར་ལོག་པའི་མཆོད་རྟེན་ཞེས་གྲགས་པ་ཡིན་ནོ། །
en: At the place where Chanda left the Bodhisattva in order to return home, a memorial was later built.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ། ཇི་ལྟར་ན་གཙུག་ཕུད་ཀྱང་ཡོད་ལ་རབ་ཏུ་བྱུང་བ་ཞེས་བྱ་བར་ཡང་འགྱུར་སྙམ་ནས་དེས་རལ་གྲིས་གཙུག་ཕུད་བཅད་དེ་བར་སྣང་ལ་བོར་བ་དང་།
en: This memorial is still known today as “Chanda’s Return.” The Bodhisattva then thought to himself, “With my hair this long, I cannot be a monk.” So he took his sword, cut off his hair, and then cast it into the air.

source: དེ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་མཆོད་པའི་ཕྱིར་བླངས་ཏེ།
en: The gods in the Heaven of the Thirty-Three collected the hair for worship.

source: དེང་སང་དུ་ཡང་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་གཙུག་ཕུད་ཀྱི་དུས་སྟོན་བྱེད་དོ། །དེར་མཆོད་རྟེན་ཡང་བྱས་ཏེ།
en: Even to this day the gods in the Heaven of the Thirty-Three celebrate this event during the Hair Festival.

source: དེང་སང་མཆོད་རྟེན་དེ་གཙུག་ཕུད་བླངས་པའི་མཆོད་རྟེན་ཞེས་མིང་དུ་ཆགས་སོ།
en: At this very place another memorial was built, which today is still known as “Receipt of the Hair.”

source: །ཡང་བྱང་ཆུབ་སེམས་དཔའ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Again the Bodhisattva considered,
